/* eslint-disable prefer-const */
/* eslint-disable semi */
/* eslint-disable no-unused-vars */

'strict';

/*

2) При помощи ajax запросов к загруженному файлу сформировать на странице карточки Героев со всеми данными
(фото, имя, настоящее имя,  список фильмов, статус). 1 персонаж - 1 карточка.

3) Реализовать переключатели-фильтры по фильмам.

Выпадающее меню или список, на ваше усмотрение

Показывать только те карточки, которые подходят под выбранный фильтр.

Стилизация карточек и всего внешнего вида - на ваше усмотрение.

Упор сделать на главную цель - донесение информации, никаких вырвиглазных цветов и шрифтов.

4) Добавить ссылку на выполненное задание

*/

import animFunc from './modules/animation.js';
import eventListeners from './modules/eventListeners.js'

animFunc();
eventListeners();
